vancouver_watching/assets/workflows.dot
digraph VanwatchWorkflow {
    rankdir=LR;
    node [shape=box, labeljust=l];

    discover [label="vanwatch\ndiscover\ntarget=<target>\n<object-name>"];
    object1 [label="geojson" shape=folder];
    ingest [label="vanwatch\ningest\ntarget=<target>\n<object-name>"];
    detect [label="vanwatch\ndetect\ngif,publish\n<object-name>"];
    ingest_detect [label="vanwatch\ningest\ntarget=<target>\n<object-name>\ndetect,gif,publish"];
    object2 [label="geojson" shape=folder];

    discover -> object1;
    object1 -> ingest [label="#target" style=dashed];
    object1 -> ingest_detect [label="#target" style=dashed];
    ingest -> object2;
    ingest_detect -> object2;
    object2 -> detect;
     detect -> object2;
}
